app/Http/Controllers/Api/ArticleController.php

    public function edit($slug): JsonResponse
    {
        try {
            $article = Article::where('slug', $slug)->with(['categories', 'keywords'])->firstOrFail();
---
select * from `articles` where `slug` = 'fdsfsd' limit 1
select `categories`.*, `article_categories`.`article_id` as `pivot_article_id`, `article_categories`.`category_id` as `pivot_category_id`, `article_categories`.`id` as `pivot_id` from `categories` inner join `article_categories` on `categories`.`id` = `article_categories`.`category_id` where `article_categories`.`article_id` in (36)
select `keywords`.*, `article_keywords`.`article_id` as `pivot_article_id`, `article_keywords`.`keyword_id` as `pivot_keyword_id`, `article_keywords`.`id` as `pivot_id` from `keywords` inner join `article_keywords` on `keywords`.`id` = `article_keywords`.`keyword_id` where `article_keywords`.`article_id` in (36)