app/Http/Controllers/Api/PageController.php

    public function get(): JsonResponse
    {
        $pages = $this->pageRepository->all(['id', 'title_en','title_bn']);
        $footerPageIds = PageLink::where(['key' => 'footer_pages'])->pluck('page_id');
        $appNavigationPageIds = PageLink::where(['key' => 'app_navigation_pages'])->pluck('page_id');
---
select `page_id` from `page_links` where (`key` = 'footer_pages')
select `page_id` from `page_links` where (`key` = 'app_navigation_pages')

    public function savePageIds(Request $request): JsonResponse
    {
        $key = $request->input('widget_name', 'footer_pages');

        PageLink::where('key', $key)->delete();
---
delete from `page_links` where `key` = 'footer_pages'