<?php
return [
    "tanventure" => "ট্যানভেঞ্চার",
    "subscribe" => "সাবস্ক্রাইব ট্যানভেঞ্চার",
    "subscribeFoot" => "নতুন পোস্ট প্রকাশিত হলে মেইল পেতে চাইলে সাবস্ক্রাইব করতে পারেন!",
    'iAm'=>'হেই! আমি তানভীর! কিন্তু আপনি আমাকে ট্যান বলতে পারেন',
//    'anotherStory'=>'পৃথিবীর বন পাহাড় এবং সমুদ্রের টানে মাতাল এক ছোকরা!',
    'anotherStory'=>'কিন্তু ওটা ভিন্ন এক গল্প',
    "letMe" => "আমার অনেক গল্প বলার ছিলো!",
    "adventure" => "#AdventureIsOutThere",
    "readLatestBlogs" => "প্রকৃতির গল্পগুলো পড়ুন",
    "readMore" => "আরও পড়ুন",
    "about" => "আমার সম্পর্কে",
    "services" => "সার্ভিস",
    "credit" => "স্বত্বাধিকার লেখকের",
    "wayISeeIt" => "আমার চোখে পৃথিবী",
    "relatedPost" => "একই রকম আরো আর্টিকেল",
    "by" => "লিখেছেন",
    '22'=>'২২',
    '23'=>'২৩',
    '24'=>'২৪',
    '25'=>'২৫',
    '26'=>'২৬',
    '27'=>'২৭',
    '28'=>'২৮',
    'জানু'=>'জানুয়ারী',
    'ফেব্রু'=>'ফেব্রুয়ারী',
    'মার্চ'=>'মার্চ',
    'এপ্রি'=>'এপ্রিল',
    'মে'=>'মে',
    'জুন'=>'জুন',
    'জুলা'=>'জুলাই',
    'আগ'=>'আগস্ট',
    'সেপ্টে'=>'সেপ্টেম্বর',
    'অক্টো'=>'অক্টোবর',
    'নভে'=>'নভেম্বর',
    'ডিসে'=>'ডিসেম্বর',
    'miss'=>'মিস',
    'mr'=>'',
    'tan'=>'ট্যান',
    'dark'=>'ডার্ক থিম',
    'light'=>'লাইট থিম',
    'theme'=>'থিম পরিবর্তন',
    'myWritings'=>'আমার লেখাগুলো...',
    'whatIWrite'=>'আমি যা লিখি...',
    'tanInfo'=>"ট্যানকে যেবার প্রথম দেখেছিলাম, ওর সারা গায়ে ধুলো, কাদার ছোপ, ছন্নছাড়া এক ভংগি যেনো তার
            চেহারায় গিল্টি করে দেয়া হয়েছে, ওর সাইকেলটা ঠেলে নিয়ে আফতাবনগরের একটা সাকো পার হচ্ছে, মুখে
            লেগে আছে বোকার মত এক টুকরো হাসি, সর্বক্ষণ, চোখদুটোতে কি যেনো একটা অনুভুতি ফুটে আছে। ওই চোখে
            কেউ ভালো করে তাকালে বুঝতে পারবে, আকাশপাতাল সব ভাবনারা তার মাথায় ঘোরে সারাক্ষণ, যা অনেকের
            কাছেই বোধগম্য হবেনা, মনে হবে নিতান্ত কিশোরসুলভ বেয়াড়া ভাবনার দল বলে। আর ও সেসব ভাবনা সবাইকে
            শোনাতেও খুব পছন্দ করতো। ওর সাথে কোনো এক উপলক্ষে কথা হয়েছিলো। ওই একবারই। তার বেশ কিছুদিন পর
            জানতে পেরেছিলাম, বিশ বছর বয়েসী সেই যুবক তার ওই সাইকেলটা, যার নাম সে দিয়েছিলো 'আশা', তাকে
            নিয়েই কোথায় যেনো হারিয়ে গেছে, বলে যায়নি সে কাউকেই, কিছু। পরিবারের একমাত্র ছেলে সে, সবে
            বিশ্ববিদ্যালয়ের প্রথম বর্ষের ছাত্র। কি হয়েছিলো ট্যানের?
            আজ অবধি আমি ছাড়া আর কেউ জানতে পারেনি তার কথা। ট্যানের সাথে আমার বন্ধুত্বটা অমন এক পর্যায়ে
            এসে দাড়িয়েছে গত তিন মাসে, সেদিন বিকেলের পর থেকে, যেদিন আমি একটা উড়োচিঠি পেয়েছিলাম- উড়ো ইমেইল
            আসলে- যে ও আমাকে ভাই বলে ডেকেছে। ট্যান যাকে ভাই সম্বোধন করে, তার সাথে ওর আত্মার সম্পর্ক,
            কখনোই তা ছিন্ন হবার নয়। আমি সে কথা জানি। ট্যানকে আমি বাধ্য করেছি, ওর নিরন্তর যাত্রার সকল
            বর্ননা আমাকে লিখে পাঠাতে। ও রাজীও হয়েছে। কিন্তু অদ্ভুত ছেলেটা ঠিক করেছে, কোনো ক্রমের ধার
            ধারবেনা সে, যখন যা ইচ্ছে করে, লিখে পাঠাবে। আর হ্যা, ঠিক, আমি, তানভীর রেজা অনিক, মিস্টার
            ট্যানের অকৃত্তিম বন্ধু, ঠিক করেছি ওর যাত্রার ইতিবৃত্ত জোড়াতালি দিয়ে একটা 'উপন্যাস' তৈরী করে
            ফেলবো। উপন্যাস শব্দের উপর আমার টান। উপন্যাস শব্দের উপর আমার অনেক দুর্বলতা। দেখা ই যাক, কি
            ঘটতে চলেছে!",
];
