app/Repositories/Article/ArticleRepository.php

    public function save(Request $request)
    {


        $image = $request->image;
        if ($image) {
            $image_ext = $image->getClientOriginalExtension();
            $image_full_name = time() . '.' . $image_ext;
            $upload_path = 'assets/images/';
            $image_url = $upload_path . $image_full_name;

            $success = $image->move($upload_path, $image_full_name);
        } else {
            $image_url = '';
        }


        $article = Article::create([
            'user_id' => auth()->user()->id,
            'title' => $request->input('title'),
            'slug' => $this->slugify($request->input('title')),
            'excerpt' => $request->input('excerpt'),
            'featured' => filter_var($request->input('featured'), FILTER_VALIDATE_BOOLEAN),
            'description' => $request->input('description'),
            'published' => filter_var($request->input('published'), FILTER_VALIDATE_BOOLEAN),
            'image_disk' => $this->disk,
            'meta_title' => $request->input('meta_title'),
            'image' => $image_url,
        ]);
        // Category
        $article->categories()->sync([$request->input('categories')]);
---
insert into `article_categories` (`article_id`, `category_id`) values (36, 2)

        $keywordIds = [];

        foreach ($newKeywords as $keyword) {
            $keyword = Keyword::firstOrCreate(['title' => $keyword]);
            array_push($keywordIds, $keyword->id);
        }

        $article->keywords()->sync($keywordIds);
---
insert into `keywords` (`title`) values ('fgdfg')
select * from `keywords` where (`title` = 'fgdfg') limit 1
insert into `article_keywords` (`article_id`, `keyword_id`) values (36, 33)

    public function update(Request $request, int $id): array
    {
        $article = Article::findOrFail($id);
        $isPublishedBefore = $article->published;

        $image = $request->image;
        if ($image) {
            $image_ext = $image->getClientOriginalExtension();
            $image_full_name = time() . '.' . $image_ext;
            $upload_path = 'assets/images/';
            $image_url = $upload_path . $image_full_name;

            $success = $image->move($upload_path, $image_full_name);
        } else {
            $image_url = '';
        }

        $data = [
            'title' => $request->input('title'),
            'slug' => $this->slugify($request->input('title')),
            'excerpt' => $request->input('excerpt'),
            'featured' => filter_var($request->input('featured'), FILTER_VALIDATE_BOOLEAN),
            'description' => $request->input('description'),
            'published' => filter_var($request->input('published'), FILTER_VALIDATE_BOOLEAN),
            'meta_title' => $request->input('meta_title'),
            'image'=>$image_url,
        ];

        // Category
        $article->categories()->detach();
        $article->categories()->sync([$request->input('categories')]);
---
select * from `articles` where `articles`.`id` = 36 limit 1
insert into `article_categories` (`article_id`, `category_id`) values (36, 2)
delete from `article_categories` where `article_categories`.`article_id` = 36

        $keywordIds = [];

        foreach ($newKeywords as $keyword) {
            $keyword = Keyword::firstOrCreate(['title' => $keyword]);
---
select * from `keywords` where (`title` = 'fgdfg') limit 1

        }

        $article->keywords()->detach();
        $article->keywords()->sync($keywordIds);
        $article->update($data);
---
insert into `article_keywords` (`article_id`, `keyword_id`) values (36, 33)
update `articles` set `title` = 'fdsfsdsdfsdfsdgdfgdfg dfg dfg dfgh dh gdhfhfgh fh gf hgc', `slug` = 'fdsfsdsdfsdfsdgdfgdfg-dfg-dfg-dfgh-dh-gdhfhfgh-fh-gf-hgc', `image` = 'fdsfsdsdfsdfsdgdfgdfg-dfg-dfg-dfgh-dh-gdhfhfgh-fh-gf-hgc-1642945832.jpg', `meta_title` = 'fsdfsdsdfs', `published` = 1, `featured` = 0, `articles`.`updated_at` = '2022-01-23 14:50:33' where `id` = 36

    public function delete(int $id)
    {
        $article = Article::findOrFail($id);
        Storage::disk($this->disk)->delete('articles/' . $article->image);
        $article->categories()->detach();
        $article->keywords()->detach();

        return $article->delete();
---
select * from `articles` where `articles`.`id` = 61 limit 1
delete from `article_keywords` where `article_keywords`.`article_id` = 36
delete from `articles` where `id` = 61
delete from `article_keywords` where `article_keywords`.`article_id` = 61
delete from `article_categories` where `article_categories`.`article_id` = 61

    public function paginate($perPage = 10)
    {
        return Article::latest()
            ->with(['categories'])
            ->when(request()->has('category'), function ($q) {
                $q->whereHas('categories', function ($sq) {
                    $sq->where('category_id', \request('category'));
                });
            })
            ->when(request()->has('is_published'), function ($q) {
                $q->where('published', (bool)request('is_published'));
            })
            ->when(\request()->has('search'), function ($q) {
                $q->where('title', 'LIKE', '%' . \request('search') . '%');
            })
            ->orderBy('viewed','desc')
            ->paginate($perPage);
---
select * from `articles` order by `created_at` desc, `viewed` desc limit 10 offset 0
select `categories`.*, `article_categories`.`article_id` as `pivot_article_id`, `article_categories`.`category_id` as `pivot_category_id`, `article_categories`.`id` as `pivot_id` from `categories` inner join `article_categories` on `categories`.`id` = `article_categories`.`category_id` where `article_categories`.`article_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select count(*) as aggregate from `articles`

    public function getArticleCount()
    {
         return Article::where('created_at', '>', Carbon::now()->subDays(1))
             ->groupBy(\DB::raw('HOUR(created_at)'))
             ->count();
---
select count(*) as aggregate from `articles` where `created_at` > '2022-01-22 15:31:55' group by HOUR(created_at)

    public function getAllArticleCount(): int
    {
        return Article::all()->count();
---
select count(*) as aggregate from `articles`

    private function baseQuery(int $categoryId = 1)
    {
        return $this->model->whereHas('categories', function ($q) use ($categoryId) {
            $q->where('is_published', '=', 0);
            $q->when($categoryId !== 1, function ($sq) use ($categoryId) {
                $sq->where('category_id', $categoryId);
            });
        });
---
select `categories`.*, `article_categories`.`article_id` as `pivot_article_id`, `article_categories`.`category_id` as `pivot_category_id`, `article_categories`.`id` as `pivot_id` from `categories` inner join `article_categories` on `categories`.`id` = `article_categories`.`category_id` where `article_categories`.`article_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 63)

    public function publishedArticles(int $categoryId, int $limit)
    {
        return $this->baseQuery($categoryId)
            ->select('id', 'title', 'slug', 'featured', 'published', 'image', 'viewed','description')
            ->with('favorites')
            ->with('categories')
            ->latest()
            ->limit($limit)
            ->get();
---
select * from `favorites` where `favorites`.`article_id` in (1, 3, 4)
select `categories`.*, `article_categories`.`article_id` as `pivot_article_id`, `article_categories`.`category_id` as `pivot_category_id`, `article_categories`.`id` as `pivot_id` from `categories` inner join `article_categories` on `categories`.`id` = `article_categories`.`category_id` where `article_categories`.`article_id` in (1, 3, 4)

    public function getArticle($condition, $isSlug = false)
    {
        return $this->model->with(['categories' => function ($q) use ($condition, $isSlug) {
            $q->with(['articles' => function ($sq) use ($condition, $isSlug) {
                $sq->select('article_id', 'title', 'slug', 'published', 'viewed', 'image', 'featured', 'description')
                    ->with('favorites')
                    ->where('published', '=', true)
                    ->when($isSlug, function ($s) use ($condition, $isSlug) {
                        $s->where('slug', '!=', $condition);
                    })
                    ->when(!$isSlug, function ($s) use ($condition, $isSlug) {
                        $s->where('article_id', '!=', $condition);
                    })
                    ->inRandomOrder()
                    ->limit(4);
            }]);
        }])
            ->with(['keywords', 'favorites'])
            ->where('published', true)
            ->when($isSlug, function ($q) use ($condition) {
                $q->where('slug', $condition);
            })
            ->when(!$isSlug, function ($q) use ($condition) {
                $q->where('id', $condition);
            })
            ->first();
---
select * from `favorites` where `favorites`.`article_id` in (1, 3, 4)
select `categories`.*, `article_categories`.`article_id` as `pivot_article_id`, `article_categories`.`category_id` as `pivot_category_id`, `article_categories`.`id` as `pivot_id` from `categories` inner join `article_categories` on `categories`.`id` = `article_categories`.`category_id` where `article_categories`.`article_id` in (1, 3, 4)
select * from `favorites` where `favorites`.`article_id` in (0)
select `keywords`.*, `article_keywords`.`article_id` as `pivot_article_id`, `article_keywords`.`keyword_id` as `pivot_keyword_id`, `article_keywords`.`id` as `pivot_id` from `keywords` inner join `article_keywords` on `keywords`.`id` = `article_keywords`.`keyword_id` where `article_keywords`.`article_id` in (1)

    public function getAllTags(){
       return Keyword::all();
---
select * from `keywords`

    public function getTagInfoWithArticles($tag, $perPage, $includeFavorites = false): array
    {
        $string = Str::title(str_replace('-', ' ', trim($tag)));
        $tag = Keyword::where('title', 'LIKE', '%' . $string . '%')->get();
        $tags = Keyword::all();

        return [
            'tagInfo' => count($tag) ? $tag[0] : null,
            'tags'=> count($tags) ? $tags : null,
            'articles' => count($tag) ? $this->getArticlesByTag($perPage, $tag->pluck('id')->toArray(), $includeFavorites) : []
        ];
---
select * from `keywords`
select `keywords`.*, `article_keywords`.`article_id` as `pivot_article_id`, `article_keywords`.`keyword_id` as `pivot_keyword_id`, `article_keywords`.`id` as `pivot_id` from `keywords` inner join `article_keywords` on `keywords`.`id` = `article_keywords`.`keyword_id` where `article_keywords`.`article_id` in (1)

    public function getArticlesByTag($perPage, array $keywordIds, $includeFavorites = false)
    {
        $q = $this->model->whereHas('keywords', function ($q) use ($keywordIds) {
            $q->whereIn('keyword_id', $keywordIds);
        })
            ->with('categories:id,name,slug')
            ->with('keywords:id,title')
            ->where('published', true)
            ->when($includeFavorites, function ($q) {
                $q->with(['favorites']);
            })
            ->select('id', 'title', 'slug', 'featured', 'published', 'image', 'viewed','description')
            ->latest();

        return $perPage === 4 ? $q->limit($perPage)->get() : $q->paginate($perPage);
---
select * from `favorites` where `favorites`.`article_id` in (0)
select `categories`.*, `article_categories`.`article_id` as `pivot_article_id`, `article_categories`.`category_id` as `pivot_category_id`, `article_categories`.`id` as `pivot_id` from `categories` inner join `article_categories` on `categories`.`id` = `article_categories`.`category_id` where `article_categories`.`article_id` in (63)
select `keywords`.*, `article_keywords`.`article_id` as `pivot_article_id`, `article_keywords`.`keyword_id` as `pivot_keyword_id`, `article_keywords`.`id` as `pivot_id` from `keywords` inner join `article_keywords` on `keywords`.`id` = `article_keywords`.`keyword_id` where `article_keywords`.`article_id` in (63)
select * from `keywords`