app/Repositories/Article/ArticleRepository.php

    public function getAllArticleCount(): int
    {
        return Article::all()->count();
---
select count(*) as aggregate from `articles` where `created_at` > '2022-01-22 19:03:11' group by HOUR(created_at)

    public function getNovels()
    {
        return $this->baseQuery(1)
            ->with('categories')
            ->latest()
            ->with('author')
            ->paginate(5);
---
select `categories`.*, `article_categories`.`article_id` as `pivot_article_id`, `article_categories`.`category_id` as `pivot_category_id`, `article_categories`.`id` as `pivot_id` from `categories` inner join `article_categories` on `categories`.`id` = `article_categories`.`category_id` where `article_categories`.`article_id` in (1)

    public function getTagInfoWithArticles($tag, $perPage, $includeFavorites = false): array
    {
        $string = Str::title(str_replace('-', ' ', trim($tag)));
        $tag = Keyword::where('title', 'LIKE', '%' . $string . '%')->get();
        $tags = Keyword::all()->unique('title');
---
select * from `keywords` where `title` LIKE '%Linnéa Findeklee Kolumne%'