app/Http/Controllers/WebsiteController.php

select `name`, `slug` from `categories` where `is_published` = 0 order by `position` asc
select * from `page_links` where `key` = 'footer_pages'
select `id`, `title`, `slug` from `pages` where `pages`.`id` in (9)
---
    public function __construct(ArticleRepository $articleRepository)
    {
        $this->homePageSeoData = json_decode(setting()->get('general'), true);
        $this->baseSeoData = [
            'title' => $this->homePageSeoData['home_page_title'],
            'description' => $this->homePageSeoData['home_page_description'],
            'keywords' => $this->homePageSeoData['home_page_keywords'],
            'image' => $this->homePageSeoData['home_page_image_url'] ?
                Storage::disk('public')->url('settings/' . basename($this->homePageSeoData['home_page_image_url']))
                :
                asset('asset/logo.png'),
            'type' => 'website',
            'site' => env('APP_URL'),
            'app_name' => $this->homePageSeoData['app_name'],
            'robots' => 'index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1'
        ];

        $this->articleRepository = $articleRepository;
        $tags = $this->articleRepository->getAllTags();
//        $tagTitles=[];
//        foreach ($tags as $tag)
//            array_push($tagTitles,$tag->title);
        $categories = Category::select('name', 'slug')->where('is_published', 0)->orderBy('position', 'asc')->pluck('name', 'slug');
        $featuredArticles = $this->articleRepository->publishedArticles(1, 3);
        $footerPages = \Cache::remember('footer_pages', config('cache.default_ttl'), function () {
            return PageLink::where('key', 'footer_pages')->with('page:id,title,slug')->get()->toArray();
        });

update `articles` set `viewed` = 1, `articles`.`updated_at` = '2022-01-23 14:36:41' where `id` = 35
update `articles` set `viewed` = 139, `articles`.`updated_at` = '2022-01-23 17:28:43' where `id` = 1
---
    public function articleDetails($slug)
    {
        $article = $this->articleRepository->getArticle($slug, true);
        if (!$article) {
            return $this->renderPage($slug);
        }
        $category = $article['categories'][0];
        $similarArticles = $this->articleRepository->getSimilarArticles($category['id'], 2);
        $tags = $article->keywords;
        $tagTitles=[];
        foreach ($tags as $tag)
            array_push($tagTitles,$tag->title);
        $segments = [
            [
                'name' => $article['categories'][0]['name'],
                'url' => route('category', [
                    'slug' => $category['slug']
                ])
            ],
            ['name' => $article['title'], 'url' => url($slug)]
        ];
        $cacheKey = request()->ip() . $slug;
        \Cache::remember($cacheKey, 60, function () use ($article) {
            $article->viewed = $article->viewed + 1;
            $article->save();
            return true;
        });

select * from `categories` where `slug` = 'Hiking' limit 1
---
    public function categoryDetails($slug)
    {
        $category = Category::where('slug', $slug)->first();

select * from `pages` where `slug` = 'get-your-blog' limit 1
select `keywords`.*, `page_keywords`.`page_id` as `pivot_page_id`, `page_keywords`.`keyword_id` as `pivot_keyword_id`, `page_keywords`.`id` as `pivot_id` from `keywords` inner join `page_keywords` on `keywords`.`id` = `page_keywords`.`keyword_id` where `page_keywords`.`page_id` in (9)
---
    public function renderPage($slug)
    {
        $page = Page::where('slug', $slug)->with('keywords')->first();