app/Http/Controllers/WebsiteController.php

select `name`, `slug` from `categories` where `is_published` = 0 order by `position` asc
---
    public function __construct(ArticleRepository $articleRepository)
    {
//        $this->homePageSeoData = json_decode(setting()->get('general'), true);
//        $this->baseSeoData = [
//            'title' => $this->homePageSeoData['home_page_title'],
//            'description' => $this->homePageSeoData['home_page_description'],
//            'keywords' => $this->homePageSeoData['home_page_keywords'],
//            'image' => $this->homePageSeoData['home_page_image_url'] ?
//                Storage::disk('public')->url('settings/' . basename($this->homePageSeoData['home_page_image_url']))
//                :
//                asset('asset/logo.png'),
//            'type' => 'website',
//            'site' => env('APP_URL'),
//            'app_name' => $this->homePageSeoData['app_name'],
//            'robots' => 'index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1'
//        ];


        $this->articleRepository = $articleRepository;
        $categories = Category::select('name', 'slug')->where('is_published', 0)->orderBy('position', 'asc')->pluck('name', 'slug');

select * from `categories` where `slug` = 'maiores' limit 1
---
    public function categoryDetails($slug)
    {
        $category = Category::where('slug', $slug)->first();